#!usr/bin/env python
# -*- coding: utf-8 -*-

import win32com
import time
from win32com.client import Dispatch, constants

datas = time.strftime('%Y%m%d')

template_path = r'D:\\' + datas + r'\\' + u'(政务)新华每日舆情'+ datas + r'.doc'
store_path = r'D:\\' + datas + r'\\Thinking\\'
ReplaceStr = u'[政务专供]'
store_path
w = win32com.client.Dispatch('Word.Application')
w.Visible = False
w.DisplayAlerts = 0

doc = w.Documents.Open( FileName = template_path )
w.Selection.Find.ClearFormatting()
w.Selection.Find.Replacement.ClearFormatting()

lst = [(u'专供骆惠宁书记郝鹏省长', u'(专供)新华每日舆情'), (u'专供青海省交通运输厅', u'(专供青海省交通运输厅)新华每日舆情'), (u'专供青海省民族宗教事务委员会', u'(专供青海省民族宗教事务委员会)新华每日舆情'),\
       (u'专供青海互助青稞酒业股份有限公司', u'(专供青海互助青稞酒业股份有限公司)新华每日舆情'),\
       (u'专供西部矿业', u'(专供西部矿业)新华每日舆情'), (u'专供青海省农村信用社联合社', u'(专供青海省农村信用社联合社)新华每日舆情'), (u'专供西宁市城西区', u'(专供西宁市城西区)新华每日舆情'),\
       (u'专供互助县', u'(专供互助县)新华每日舆情'), (u'专供平安区', u'(专供平安区)新华每日舆情'), (u'专供乐都区', u'(专供乐都区)新华每日舆情'),\
       (u'专供化隆县', u'(专供化隆县)新华每日舆情'), (u'专供循化县', u'(专供循化县)新华每日舆情'), (u'专供民和县', u'(专供民和县)新华每日舆情'),\
       (u'专供海西蒙古族藏族自治州', u'(专供海西蒙古族藏族自治州)新华每日舆情'), (u'专供德令哈市', u'(专供德令哈市)新华每日舆情'), (u'专供格尔木市', u'(专供格尔木市)新华每日舆情'),\
       (u'专供都兰县', u'(专供都兰县)新华每日舆情'), (u'专供乌兰县', u'(专供乌兰县)新华每日舆情'), (u'专供天峻县', u'(专供天峻县)新华每日舆情'),\
       (u'专供格尔木市卫生局', u'(专供格尔木市卫生局)新华每日舆情'), (u'专供格尔木市教育局', u'(专供格尔木市教育局)新华每日舆情'), (u'专供格尔木市住房和城乡建设局', u'(专供格尔木市住房和城乡建设局)新华每日舆情'),\
       (u'专供格尔木市文化体育广播电视局', u'(专供格尔木市文化体育广播电视局)新华每日舆情'), (u'专供格尔木市西城区工行委', u'(专供格尔木市西城区工行委)新华每日舆情'), (u'专供格尔木市东城区工行委', u'(专供格尔木市东城区工行委)新华每日舆情'),\
       (u'专供格尔木市察尔汗工行委', u'(专供格尔木市察尔汗工行委)新华每日舆情'), (u'专供格尔木市昆仑经济技术开发区', u'(专供格尔木市昆仑经济技术开发区)新华每日舆情'),\
       (u'专供海南藏族自治州', u'(专供海南藏族自治州)新华每日舆情'), (u'专供兴海县', u'(专供兴海县)新华每日舆情'), (u'专供贵南县', u'(专供贵南县)新华每日舆情'),\
       (u'专供同德县', u'(专供同德县)新华每日舆情'),(u'专供海晏县', u'(专供海晏县)新华每日舆情'), (u'专供门源县', u'(专供门源县)新华每日舆情'),\
       (u'专供祁连县', u'(专供祁连县)新华每日舆情'), (u'专供黄南藏族自治州', u'(专供黄南藏族自治州)新华每日舆情'), (u'专供河南县', u'(专供河南县)新华每日舆情'),\
       (u'专供果洛藏族自治州', u'(专供果洛藏族自治州)新华每日舆情'), (u'专供达日县', u'(专供达日县)新华每日舆情'), (u'', u'[专供]新华每日舆情')]

for i in lst:
    NewStr, ReplaceStr = ReplaceStr, i[0]
    w.Selection.Find.Execute(NewStr, False, False, False, False, False, True, 1, True, ReplaceStr, 2)
    doc.SaveAs(store_path + i[1] + datas + '.doc')

w.Documents.Close()
w.Quit()
